benchmarks/results/haproxy_t1c1_180s_bench.txt
Running 3m test @ http://localhost:80
  1 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   181.30us  435.69us  17.09ms   96.47%
    Req/Sec    13.24k     1.34k   15.67k    82.22%
  Latency Distribution
     50%  120.00us
     75%  144.00us
     90%  206.00us
     99%    1.56ms
  2372112 requests in 3.00m, 294.09MB read
Requests/sec:  13173.44
Transfer/sec:      1.63MB